
## Plan Result

[CI link](https://github.com/clov3r-cc/infra/actions/runs/18802404116)


<pre><code>Plan: 0 to add, 1 to change, 0 to destroy.</code></pre>

* Update
  * cloudflare_pages_project.homepage


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_pages_project.homepage will be updated in-place
  ~ resource "cloudflare_pages_project" "homepage" {
      ~ canonical_deployment = {
          ~ aliases            = [
              - "https://clov3r.cc",
              - "https://www.clov3r.cc",
            ] -> (known after apply)
          ~ build_config       = {
              + build_caching       = (known after apply)
              + build_command       = (known after apply)
              + destination_dir     = (known after apply)
              + root_dir            = (known after apply)
              + web_analytics_tag   = (known after apply)
              + web_analytics_token = (sensitive value)
            } -> (known after apply)
          ~ created_on         = "2025-10-25T06:56:49Z" -> (known after apply)
          ~ deployment_trigger = {
              ~ metadata = {
                  ~ branch         = "main" -> (known after apply)
                  + commit_hash    = (known after apply)
                  + commit_message = (known after apply)
                } -> (known after apply)
              ~ type     = "ad_hoc" -> (known after apply)
            } -> (known after apply)
          ~ env_vars           = {} -> (known after apply)
          ~ environment        = "production" -> (known after apply)
          ~ id                 = "954348d9-13d3-4816-8890-335b129aaee8" -> (known after apply)
          ~ is_skipped         = false -> (known after apply)
          ~ latest_stage       = {
              ~ ended_on   = "2025-10-25T06:56:52Z" -> (known after apply)
              ~ name       = "deploy" -> (known after apply)
              + started_on = (known after apply)
              ~ status     = "success" -> (known after apply)
            } -> (known after apply)
          ~ modified_on        = "2025-10-25T06:56:52Z" -> (known after apply)
          ~ project_id         = "f9e9ebc0-fd49-433a-9d6c-ecf93d800066" -> (known after apply)
          ~ project_name       = "my-home" -> (known after apply)
          ~ short_id           = "954348d9" -> (known after apply)
          + source             = (known after apply)
          ~ stages             = [
              - {
                  - name       = "queued" -> null
                  - started_on = "2025-10-25T06:56:49Z" -> null
                  - status     = "active" -> null
                },
              - {
                  - name   = "initialize" -> null
                  - status = "idle" -> null
                },
              - {
                  - name   = "clone_repo" -> null
                  - status = "idle" -> null
                },
              - {
                  - name   = "build" -> null
                  - status = "idle" -> null
                },
              - {
                  - ended_on = "2025-10-25T06:56:52Z" -> null
                  - name     = "deploy" -> null
                  - status   = "success" -> null
                },
            ] -> (known after apply)
          ~ url                = "https://954348d9.my-home.pages.dev" -> (known after apply)
        } -> (known after apply)
      ~ deployment_configs   = {
          ~ preview    = {
              - compatibility_date  = "2025-10-25" -> null
              - compatibility_flags = [] -> null
            }
          ~ production = {
              - compatibility_flags = [] -> null
                # (1 unchanged attribute hidden)
            }
        }
        id                   = "my-home"
      ~ latest_deployment    = {
          ~ build_config       = {
              + build_caching       = (known after apply)
              + build_command       = (known after apply)
              + destination_dir     = (known after apply)
              + root_dir            = (known after apply)
              + web_analytics_tag   = (known after apply)
              + web_analytics_token = (sensitive value)
            }
            id                 = "954348d9-13d3-4816-8890-335b129aaee8"
          ~ latest_stage       = {
                name       = "deploy"
              + started_on = (known after apply)
                # (2 unchanged attributes hidden)
            }
          + source             = (known after apply)
          ~ stages             = [
              ~ {
                  + ended_on   = (known after apply)
                    name       = "queued"
                    # (2 unchanged attributes hidden)
                },
              ~ {
                  + ended_on   = (known after apply)
                    name       = "initialize"
                  + started_on = (known after apply)
                    # (1 unchanged attribute hidden)
                },
              ~ {
                  + ended_on   = (known after apply)
                    name       = "clone_repo"
                  + started_on = (known after apply)
                    # (1 unchanged attribute hidden)
                },
              ~ {
                  + ended_on   = (known after apply)
                    name       = "build"
                  + started_on = (known after apply)
                    # (1 unchanged attribute hidden)
                },
              ~ {
                    name       = "deploy"
                  + started_on = (known after apply)
                    # (2 unchanged attributes hidden)
                },
            ]
            # (11 unchanged attributes hidden)
        }
        name                 = "my-home"
        # (6 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Warning: Redundant ignore_changes element

  on my_homepage.tf line 1, in resource "cloudflare_pages_project" "homepage":
   1: resource "cloudflare_pages_project" "homepage" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute created_on is decided by the provider alone and therefore there
can be no configured value to compare with. Including this attribute in
ignore_changes has no effect. Remove the attribute from ignore_changes to
quiet this warning.

(and 3 more similar warnings elsewhere)
```

</details>



## :warning: Warnings

```hcl
Warning: Redundant ignore_changes element

  on my_homepage.tf line 1, in resource "cloudflare_pages_project" "homepage":
   1: resource "cloudflare_pages_project" "homepage" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute created_on is decided by the provider alone and therefore there
can be no configured value to compare with. Including this attribute in
ignore_changes has no effect. Remove the attribute from ignore_changes to
quiet this warning.

(and 3 more similar warnings elsewhere)
```



<!-- github-comment: {"Command":"plan","JobName":"tf_plan","PRNumber":118,"Program":"tfcmt","SHA1":"00573bd109fa1a0220d71af7e1e8349e8a582c72","Vars":{},"WorkflowName":"Terraform CI"} -->